Revit 2027 API
PointCloudColorEncoding Enumeration
 The color encodings supported by Revit point clouds.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum PointCloudColorEncoding
Public Enumeration PointCloudColorEncoding
public enum class PointCloudColorEncoding
type PointCloudColorEncoding
Members
Member name | Value | Description
ABGR | 1 |  The point cloud uses colors arranged in ABGR format (common in Windows).
ARGB | 0 |  The point cloud uses colors arranged in ARGB format.
See Also
Reference
Autodesk.Revit.DB.PointClouds Namespace